Transform:
Remove duplicate records
Handle missing values (use appropriate strategy: drop, fill, or default)
Standardize phone formats (e.g., +91-9876543210)
Standardize category names (e.g., "electronics", "Electronics", "ELECTRONICS" â†’ "Electronics")
Convert date formats to YYYY-MM-DD
Add surrogate keys (auto-incrementing IDs)

In [145]:
#import necessary libraries
import pandas as pd
import numpy as np
import phonenumbers

In [146]:
#general function to find and treat missing values
def find_treat_missing_val(df):
    missing_col=[]
    numeric_col=df.select_dtypes(include=["int","float","float64","number"]).columns.tolist() 
    categorical_col=df.select_dtypes(include=["object","category","bool"]).columns.tolist() 
    
    for col,cnt in df.isna().sum().items(): 
        if cnt>0: 
            missing_col.append(f"{col} is missing in {cnt} rows") 
             # Fill numeric columns with median
            if col in numeric_col: 
                df[col]=df[col].fillna(df[col].median()) 
            
            
    return df, missing_col

In [147]:
#function to format phone numbers
def simple_phone_format(x):
    if pd.isna(x):
        return None
    digits = ''.join(filter(str.isdigit, str(x)))
    return "+91-" + digits[-10:]

In [148]:
#load datasets
customers = pd.read_csv("C:\\Users\\Saakshi\\Documents\\GitHub\\bitsom_ba_25071110-fleximart-data-architecture\\data\\customers_raw.csv", skip_blank_lines=True)
products = pd.read_csv("C:\\Users\\Saakshi\\Documents\\GitHub\\bitsom_ba_25071110-fleximart-data-architecture\\data\\products_raw.csv")
sales = pd.read_csv("C:\\Users\\Saakshi\\Documents\\GitHub\\bitsom_ba_25071110-fleximart-data-architecture\\data\\sales_raw.csv")

Cleaning Customers dataset

In [149]:
customers.info

<bound method DataFrame.info of    customer_id first_name last_name                     email           phone  \
0         C001      Rahul    Sharma    rahul.sharma@gmail.com      9876543210
1         C002      Priya     Patel     priya.patel@yahoo.com  +91-9988776655
2         C003       Amit     Kumar                       NaN      9765432109
3         C004      Sneha     Reddy     sneha.reddy@gmail.com      9123456789
4         C005     Vikram     Singh  vikram.singh@outlook.com     09988112233
5         C006     Anjali     Mehta    anjali.mehta@gmail.com      9876543210
6         C007       Ravi     Verma                       NaN   +919876501234
7         C008      Pooja      Iyer      pooja.iyer@gmail.com      9123456780
8         C009    Karthik      Nair    karthik.nair@yahoo.com      9988776644
9         C010      Deepa     Gupta     deepa.gupta@gmail.com     09871234567
10        C001      Rahul    Sharma    rahul.sharma@gmail.com      9876543210
11        C011      Arjun       Rao       arjun.rao@gmail.com      9876509876
12        C012    Lakshmi  Krishnan                       NaN      9988001122
13        C013     Suresh     Patel  suresh.patel@outlook.com      9123409876
14        C014       Neha      Shah       neha.shah@gmail.com  +91-9876543221
15        C015     Manish     Joshi    manish.joshi@yahoo.com      9988776611
16        C016      Divya     Menon     divya.menon@gmail.com      9123456701
17        C017     Rajesh     Kumar    rajesh.kumar@gmail.com     09876123450
18        C018      Kavya     Reddy                       NaN      9988112200
19        C019       Arun    Pillai   arun.pillai@outlook.com      9876543298
20        C020      Swati     Desai     swati.desai@gmail.com      9123456712
21        C021     Nikhil      Bose     nikhil.bose@gmail.com   +919988776600
22        C022   Priyanka      Jain   priyanka.jain@yahoo.com      9876543287
23        C023      Rohit    Kapoor                       NaN      9988112211
24        C024      Meera   Nambiar   meera.nambiar@gmail.com      9123456723
25        C025     Sanjay   Agarwal  sanjay.agarwal@gmail.com     09876543276

          city registration_date
0    Bangalore        2023-01-15
1       Mumbai        2023-02-20
2        Delhi        2023-03-10
3    Hyderabad        15/04/2023
4      Chennai        2023-05-22
5    Bangalore        2023-06-18
6         Pune        2023-07-25
7    Bangalore        08-15-2023
8        Kochi        2023-09-30
9        Delhi        2023-10-12
10   Bangalore        2023-01-15
11   Hyderabad        2023-11-05
12     Chennai        2023-12-01
13      Mumbai        2024-01-08
14   Ahmedabad        2024-01-15
15      Jaipur        20/01/2024
16   Bangalore        2024-02-05
17       Delhi        2024-02-12
18   Hyderabad        2024-02-18
19       Kochi        02-25-2024
20        Pune        2024-03-01
21     Kolkata        2024-03-10
22      Indore        2024-03-15
23  Chandigarh        2024-03-20
24  Trivandrum        03-25-2024
25     Lucknow        2024-03-28  >

In [150]:
customers.shape

(26, 7)

In [151]:
find_treat_missing_val(customers)

(   customer_id first_name last_name                     email           phone  \
 0         C001      Rahul    Sharma    rahul.sharma@gmail.com      9876543210
 1         C002      Priya     Patel     priya.patel@yahoo.com  +91-9988776655
 2         C003       Amit     Kumar                       NaN      9765432109
 3         C004      Sneha     Reddy     sneha.reddy@gmail.com      9123456789
 4         C005     Vikram     Singh  vikram.singh@outlook.com     09988112233
 5         C006     Anjali     Mehta    anjali.mehta@gmail.com      9876543210
 6         C007       Ravi     Verma                       NaN   +919876501234
 7         C008      Pooja      Iyer      pooja.iyer@gmail.com      9123456780
 8         C009    Karthik      Nair    karthik.nair@yahoo.com      9988776644
 9         C010      Deepa     Gupta     deepa.gupta@gmail.com     09871234567
 10        C001      Rahul    Sharma    rahul.sharma@gmail.com      9876543210
 11        C011      Arjun       Rao       arjun.rao@gmail.com      9876509876
 12        C012    Lakshmi  Krishnan                       NaN      9988001122
 13        C013     Suresh     Patel  suresh.patel@outlook.com      9123409876
 14        C014       Neha      Shah       neha.shah@gmail.com  +91-9876543221
 15        C015     Manish     Joshi    manish.joshi@yahoo.com      9988776611
 16        C016      Divya     Menon     divya.menon@gmail.com      9123456701
 17        C017     Rajesh     Kumar    rajesh.kumar@gmail.com     09876123450
 18        C018      Kavya     Reddy                       NaN      9988112200
 19        C019       Arun    Pillai   arun.pillai@outlook.com      9876543298
 20        C020      Swati     Desai     swati.desai@gmail.com      9123456712
 21        C021     Nikhil      Bose     nikhil.bose@gmail.com   +919988776600
 22        C022   Priyanka      Jain   priyanka.jain@yahoo.com      9876543287
 23        C023      Rohit    Kapoor                       NaN      9988112211
 24        C024      Meera   Nambiar   meera.nambiar@gmail.com      9123456723
 25        C025     Sanjay   Agarwal  sanjay.agarwal@gmail.com     09876543276

           city registration_date
 0    Bangalore        2023-01-15
 1       Mumbai        2023-02-20
 2        Delhi        2023-03-10
 3    Hyderabad        15/04/2023
 4      Chennai        2023-05-22
 5    Bangalore        2023-06-18
 6         Pune        2023-07-25
 7    Bangalore        08-15-2023
 8        Kochi        2023-09-30
 9        Delhi        2023-10-12
 10   Bangalore        2023-01-15
 11   Hyderabad        2023-11-05
 12     Chennai        2023-12-01
 13      Mumbai        2024-01-08
 14   Ahmedabad        2024-01-15
 15      Jaipur        20/01/2024
 16   Bangalore        2024-02-05
 17       Delhi        2024-02-12
 18   Hyderabad        2024-02-18
 19       Kochi        02-25-2024
 20        Pune        2024-03-01
 21     Kolkata        2024-03-10
 22      Indore        2024-03-15
 23  Chandigarh        2024-03-20
 24  Trivandrum        03-25-2024
 25     Lucknow        2024-03-28  ,
 ['email is missing in 5 rows'])

In [152]:
#remove duplicates
customers = customers.drop_duplicates(keep='first', subset=['customer_id'])
customers.shape

(25, 7)

In [153]:
customers

,customer_id,first_name,last_name,email,phone,city,registration_date
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,9876543210,Bangalore,2023-01-15
1,C002,Priya,Patel,priya.patel@yahoo.com,+91-9988776655,Mumbai,2023-02-20
2,C003,Amit,Kumar,NaN,9765432109,Delhi,2023-03-10
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,9123456789,Hyderabad,15/04/2023
4,C005,Vikram,Singh,vikram.singh@outlook.com,09988112233,Chennai,2023-05-22
5,C006,Anjali,Mehta,anjali.mehta@gmail.com,9876543210,Bangalore,2023-06-18
6,C007,Ravi,Verma,NaN,+919876501234,Pune,2023-07-25
7,C008,Pooja,Iyer,pooja.iyer@gmail.com,9123456780,Bangalore,08-15-2023
8,C009,Karthik,Nair,karthik.nair@yahoo.com,9988776644,Kochi,2023-09-30
9,C010,Deepa,Gupta,deepa.gupta@gmail.com,09871234567,Delhi,2023-10-12
11,C011,Arjun,Rao,arjun.rao@gmail.com,9876509876,Hyderabad,2023-11-05
12,C012,Lakshmi,Krishnan,NaN,9988001122,Chennai,2023-12-01
13,C013,Suresh,Patel,suresh.patel@outlook.com,9123409876,Mumbai,2024-01-08
14,C014,Neha,Shah,neha.shah@gmail.com,+91-9876543221,Ahmedabad,2024-01-15
15,C015,Manish,Joshi,manish.joshi@yahoo.com,9988776611,Jaipur,20/01/2024
16,C016,Divya,Menon,divya.menon@gmail.com,9123456701,Bangalore,2024-02-05
17,C017,Rajesh,Kumar,rajesh.kumar@gmail.com,09876123450,Delhi,2024-02-12
18,C018,Kavya,Reddy,NaN,9988112200,Hyderabad,2024-02-18
19,C019,Arun,Pillai,arun.pillai@outlook.com,9876543298,Kochi,02-25-2024
20,C020,Swati,Desai,swati.desai@gmail.com,9123456712,Pune,2024-03-01
21,C021,Nikhil,Bose,nikhil.bose@gmail.com,+919988776600,Kolkata,2024-03-10
22,C022,Priyanka,Jain,priyanka.jain@yahoo.com,9876543287,Indore,2024-03-15
23,C023,Rohit,Kapoor,NaN,9988112211,Chandigarh,2024-03-20
24,C024,Meera,Nambiar,meera.nambiar@gmail.com,9123456723,Trivandrum,03-25-2024
25,C025,Sanjay,Agarwal,sanjay.agarwal@gmail.com,09876543276,Lucknow,2024-03-28

In [154]:
#format registration_date to YYYY-MM-DD
customers.loc[:, 'registration_date'] = pd.to_datetime(
customers['registration_date'], errors='coerce'
).dt.strftime("%Y-%m-%d")

In [155]:
customers['registration_date']

0     2023-01-15
1     2023-02-20
2     2023-03-10
3            NaN
4     2023-05-22
5     2023-06-18
6     2023-07-25
7            NaN
8     2023-09-30
9     2023-10-12
11    2023-11-05
12    2023-12-01
13    2024-01-08
14    2024-01-15
15           NaN
16    2024-02-05
17    2024-02-12
18    2024-02-18
19           NaN
20    2024-03-01
21    2024-03-10
22    2024-03-15
23    2024-03-20
24           NaN
25    2024-03-28
Name: registration_date, dtype: object

In [156]:
#format phone numbers
customers.loc[:, 'phone'] = customers['phone'].apply(simple_phone_format)
customers['phone']

0     +91-9876543210
1     +91-9988776655
2     +91-9765432109
3     +91-9123456789
4     +91-9988112233
5     +91-9876543210
6     +91-9876501234
7     +91-9123456780
8     +91-9988776644
9     +91-9871234567
11    +91-9876509876
12    +91-9988001122
13    +91-9123409876
14    +91-9876543221
15    +91-9988776611
16    +91-9123456701
17    +91-9876123450
18    +91-9988112200
19    +91-9876543298
20    +91-9123456712
21    +91-9988776600
22    +91-9876543287
23    +91-9988112211
24    +91-9123456723
25    +91-9876543276
Name: phone, dtype: object

In [157]:
#Title case for city names
customers.loc[:, 'city'] = customers['city'].str.title()
customers['city']

0      Bangalore
1         Mumbai
2          Delhi
3      Hyderabad
4        Chennai
5      Bangalore
6           Pune
7      Bangalore
8          Kochi
9          Delhi
11     Hyderabad
12       Chennai
13        Mumbai
14     Ahmedabad
15        Jaipur
16     Bangalore
17         Delhi
18     Hyderabad
19         Kochi
20          Pune
21       Kolkata
22        Indore
23    Chandigarh
24    Trivandrum
25       Lucknow
Name: city, dtype: object

In [158]:
customers

,customer_id,first_name,last_name,email,phone,city,registration_date
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,+91-9876543210,Bangalore,2023-01-15
1,C002,Priya,Patel,priya.patel@yahoo.com,+91-9988776655,Mumbai,2023-02-20
2,C003,Amit,Kumar,NaN,+91-9765432109,Delhi,2023-03-10
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,+91-9123456789,Hyderabad,NaN
4,C005,Vikram,Singh,vikram.singh@outlook.com,+91-9988112233,Chennai,2023-05-22
5,C006,Anjali,Mehta,anjali.mehta@gmail.com,+91-9876543210,Bangalore,2023-06-18
6,C007,Ravi,Verma,NaN,+91-9876501234,Pune,2023-07-25
7,C008,Pooja,Iyer,pooja.iyer@gmail.com,+91-9123456780,Bangalore,NaN
8,C009,Karthik,Nair,karthik.nair@yahoo.com,+91-9988776644,Kochi,2023-09-30
9,C010,Deepa,Gupta,deepa.gupta@gmail.com,+91-9871234567,Delhi,2023-10-12
11,C011,Arjun,Rao,arjun.rao@gmail.com,+91-9876509876,Hyderabad,2023-11-05
12,C012,Lakshmi,Krishnan,NaN,+91-9988001122,Chennai,2023-12-01
13,C013,Suresh,Patel,suresh.patel@outlook.com,+91-9123409876,Mumbai,2024-01-08
14,C014,Neha,Shah,neha.shah@gmail.com,+91-9876543221,Ahmedabad,2024-01-15
15,C015,Manish,Joshi,manish.joshi@yahoo.com,+91-9988776611,Jaipur,NaN
16,C016,Divya,Menon,divya.menon@gmail.com,+91-9123456701,Bangalore,2024-02-05
17,C017,Rajesh,Kumar,rajesh.kumar@gmail.com,+91-9876123450,Delhi,2024-02-12
18,C018,Kavya,Reddy,NaN,+91-9988112200,Hyderabad,2024-02-18
19,C019,Arun,Pillai,arun.pillai@outlook.com,+91-9876543298,Kochi,NaN
20,C020,Swati,Desai,swati.desai@gmail.com,+91-9123456712,Pune,2024-03-01
21,C021,Nikhil,Bose,nikhil.bose@gmail.com,+91-9988776600,Kolkata,2024-03-10
22,C022,Priyanka,Jain,priyanka.jain@yahoo.com,+91-9876543287,Indore,2024-03-15
23,C023,Rohit,Kapoor,NaN,+91-9988112211,Chandigarh,2024-03-20
24,C024,Meera,Nambiar,meera.nambiar@gmail.com,+91-9123456723,Trivandrum,NaN
25,C025,Sanjay,Agarwal,sanjay.agarwal@gmail.com,+91-9876543276,Lucknow,2024-03-28

In [159]:
customers.shape

(25, 7)

In [160]:
# keep for reporting
customers_all = customers.copy()

# load-safe version to handle missing emails
customers.loc[:,"email"] = customers["email"].fillna(customers["customer_id"] + "@unknown.com")

customers.shape

(25, 7)

In [161]:
customers

,customer_id,first_name,last_name,email,phone,city,registration_date
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,+91-9876543210,Bangalore,2023-01-15
1,C002,Priya,Patel,priya.patel@yahoo.com,+91-9988776655,Mumbai,2023-02-20
2,C003,Amit,Kumar,C003@unknown.com,+91-9765432109,Delhi,2023-03-10
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,+91-9123456789,Hyderabad,NaN
4,C005,Vikram,Singh,vikram.singh@outlook.com,+91-9988112233,Chennai,2023-05-22
5,C006,Anjali,Mehta,anjali.mehta@gmail.com,+91-9876543210,Bangalore,2023-06-18
6,C007,Ravi,Verma,C007@unknown.com,+91-9876501234,Pune,2023-07-25
7,C008,Pooja,Iyer,pooja.iyer@gmail.com,+91-9123456780,Bangalore,NaN
8,C009,Karthik,Nair,karthik.nair@yahoo.com,+91-9988776644,Kochi,2023-09-30
9,C010,Deepa,Gupta,deepa.gupta@gmail.com,+91-9871234567,Delhi,2023-10-12
11,C011,Arjun,Rao,arjun.rao@gmail.com,+91-9876509876,Hyderabad,2023-11-05
12,C012,Lakshmi,Krishnan,C012@unknown.com,+91-9988001122,Chennai,2023-12-01
13,C013,Suresh,Patel,suresh.patel@outlook.com,+91-9123409876,Mumbai,2024-01-08
14,C014,Neha,Shah,neha.shah@gmail.com,+91-9876543221,Ahmedabad,2024-01-15
15,C015,Manish,Joshi,manish.joshi@yahoo.com,+91-9988776611,Jaipur,NaN
16,C016,Divya,Menon,divya.menon@gmail.com,+91-9123456701,Bangalore,2024-02-05
17,C017,Rajesh,Kumar,rajesh.kumar@gmail.com,+91-9876123450,Delhi,2024-02-12
18,C018,Kavya,Reddy,C018@unknown.com,+91-9988112200,Hyderabad,2024-02-18
19,C019,Arun,Pillai,arun.pillai@outlook.com,+91-9876543298,Kochi,NaN
20,C020,Swati,Desai,swati.desai@gmail.com,+91-9123456712,Pune,2024-03-01
21,C021,Nikhil,Bose,nikhil.bose@gmail.com,+91-9988776600,Kolkata,2024-03-10
22,C022,Priyanka,Jain,priyanka.jain@yahoo.com,+91-9876543287,Indore,2024-03-15
23,C023,Rohit,Kapoor,C023@unknown.com,+91-9988112211,Chandigarh,2024-03-20
24,C024,Meera,Nambiar,meera.nambiar@gmail.com,+91-9123456723,Trivandrum,NaN
25,C025,Sanjay,Agarwal,sanjay.agarwal@gmail.com,+91-9876543276,Lucknow,2024-03-28

Cleaning Products dataset

In [162]:
products.shape

(20, 5)

In [163]:
products

   product_id         product_name     category    price  stock_quantity
0        P001   Samsung Galaxy S21  Electronics  45999.0           150.0
1        P002   Nike Running Shoes      fashion   3499.0            80.0
2        P003    Apple MacBook Pro  ELECTRONICS      NaN            45.0
3        P004         Levi's Jeans      Fashion   2999.0           120.0
4        P005      Sony Headphones  electronics   1999.0           200.0
5        P006      Organic Almonds    Groceries    899.0             NaN
6        P007            HP Laptop  Electronics  52999.0            60.0
7        P008       Adidas T-Shirt      FASHION   1299.0           150.0
8        P009     Basmati Rice 5kg    groceries    650.0           300.0
9        P010         OnePlus Nord  Electronics      NaN            95.0
10       P011        Puma Sneakers      Fashion   4599.0            70.0
11       P012  Dell Monitor 24inch  Electronics  12999.0            40.0
12       P013       Woodland Shoes      fashion   5499.0            55.0
13       P014            iPhone 13  Electronics  69999.0            80.0
14       P015   Organic Honey 500g    Groceries    450.0           200.0
15       P016    Samsung TV 43inch  ELECTRONICS  32999.0            35.0
16       P017            H&M Shirt      Fashion      NaN            90.0
17       P018       Masoor Dal 1kg    groceries    120.0           500.0
18       P019         Boat Earbuds  Electronics   1499.0           250.0
19       P020    Reebok Trackpants      FASHION   1899.0           110.0

In [164]:
#find and treat missing values in products dataset
find_treat_missing_val(products)

(   product_id         product_name     category    price  stock_quantity
 0        P001   Samsung Galaxy S21  Electronics  45999.0           150.0
 1        P002   Nike Running Shoes      fashion   3499.0            80.0
 2        P003    Apple MacBook Pro  ELECTRONICS   2999.0            45.0
 3        P004         Levi's Jeans      Fashion   2999.0           120.0
 4        P005      Sony Headphones  electronics   1999.0           200.0
 5        P006      Organic Almonds    Groceries    899.0            95.0
 6        P007            HP Laptop  Electronics  52999.0            60.0
 7        P008       Adidas T-Shirt      FASHION   1299.0           150.0
 8        P009     Basmati Rice 5kg    groceries    650.0           300.0
 9        P010         OnePlus Nord  Electronics   2999.0            95.0
 10       P011        Puma Sneakers      Fashion   4599.0            70.0
 11       P012  Dell Monitor 24inch  Electronics  12999.0            40.0
 12       P013       Woodland Shoes      fashion   5499.0            55.0
 13       P014            iPhone 13  Electronics  69999.0            80.0
 14       P015   Organic Honey 500g    Groceries    450.0           200.0
 15       P016    Samsung TV 43inch  ELECTRONICS  32999.0            35.0
 16       P017            H&M Shirt      Fashion   2999.0            90.0
 17       P018       Masoor Dal 1kg    groceries    120.0           500.0
 18       P019         Boat Earbuds  Electronics   1499.0           250.0
 19       P020    Reebok Trackpants      FASHION   1899.0           110.0,
 ['price is missing in 3 rows', 'stock_quantity is missing in 1 rows'])

In [165]:
products.shape

(20, 5)

In [166]:
#remove duplicates
products = products.drop_duplicates(keep='first', subset=['product_id'])
products.shape

(20, 5)

In [167]:
#format category names
products.loc[:, 'category'] = products['category'].str.title().str.strip()
products['category']

0     Electronics
1         Fashion
2     Electronics
3         Fashion
4     Electronics
5       Groceries
6     Electronics
7         Fashion
8       Groceries
9     Electronics
10        Fashion
11    Electronics
12        Fashion
13    Electronics
14      Groceries
15    Electronics
16        Fashion
17      Groceries
18    Electronics
19        Fashion
Name: category, dtype: object

In [168]:
#strip whitespace from product names
products.loc[:, "product_name"] = products["product_name"].str.strip()
products["product_name"]

0      Samsung Galaxy S21
1      Nike Running Shoes
2       Apple MacBook Pro
3            Levi's Jeans
4         Sony Headphones
5         Organic Almonds
6               HP Laptop
7          Adidas T-Shirt
8        Basmati Rice 5kg
9            OnePlus Nord
10          Puma Sneakers
11    Dell Monitor 24inch
12         Woodland Shoes
13              iPhone 13
14     Organic Honey 500g
15      Samsung TV 43inch
16              H&M Shirt
17         Masoor Dal 1kg
18           Boat Earbuds
19      Reebok Trackpants
Name: product_name, dtype: object

In [169]:
products.shape

(20, 5)

In [170]:
products

   product_id         product_name     category    price  stock_quantity
0        P001   Samsung Galaxy S21  Electronics  45999.0           150.0
1        P002   Nike Running Shoes      Fashion   3499.0            80.0
2        P003    Apple MacBook Pro  Electronics   2999.0            45.0
3        P004         Levi's Jeans      Fashion   2999.0           120.0
4        P005      Sony Headphones  Electronics   1999.0           200.0
5        P006      Organic Almonds    Groceries    899.0            95.0
6        P007            HP Laptop  Electronics  52999.0            60.0
7        P008       Adidas T-Shirt      Fashion   1299.0           150.0
8        P009     Basmati Rice 5kg    Groceries    650.0           300.0
9        P010         OnePlus Nord  Electronics   2999.0            95.0
10       P011        Puma Sneakers      Fashion   4599.0            70.0
11       P012  Dell Monitor 24inch  Electronics  12999.0            40.0
12       P013       Woodland Shoes      Fashion   5499.0            55.0
13       P014            iPhone 13  Electronics  69999.0            80.0
14       P015   Organic Honey 500g    Groceries    450.0           200.0
15       P016    Samsung TV 43inch  Electronics  32999.0            35.0
16       P017            H&M Shirt      Fashion   2999.0            90.0
17       P018       Masoor Dal 1kg    Groceries    120.0           500.0
18       P019         Boat Earbuds  Electronics   1499.0           250.0
19       P020    Reebok Trackpants      Fashion   1899.0           110.0

Cleaning Sales dataset

In [171]:
sales.shape

(41, 7)

In [172]:
sales

,transaction_id,customer_id,product_id,quantity,unit_price,transaction_date,status
0,T001,C001,P001,1,45999.0,2024-01-15,Completed
1,T002,C002,P004,2,2999.0,2024-01-16,Completed
2,T003,C003,P007,1,52999.0,15/01/2024,Completed
3,T004,NaN,P002,1,3499.0,2024-01-18,Pending
4,T005,C005,P009,3,650.0,2024-01-20,Completed
5,T006,C006,P012,1,12999.0,01-22-2024,Completed
6,T007,C007,P005,2,1999.0,2024-01-23,Completed
7,T008,C008,NaN,1,1299.0,2024-01-25,Completed
8,T009,C009,P011,1,4599.0,2024-01-28,Cancelled
9,T010,C010,P006,5,899.0,2024-02-01,Completed
10,T001,C001,P001,1,45999.0,2024-01-15,Completed
11,T011,C011,P014,1,69999.0,02/02/2024,Completed
12,T012,C012,P003,1,52999.0,2024-02-05,Completed
13,T013,C013,P015,3,450.0,2024-02-08,Completed
14,T014,C014,P019,2,1499.0,02-10-2024,Completed
15,T015,C015,P008,3,1299.0,2024-02-12,Completed
16,T016,NaN,P013,1,5499.0,2024-02-15,Pending
17,T017,C017,P016,1,32999.0,2024-02-18,Completed
18,T018,C018,P020,2,1899.0,2024-02-20,Completed
19,T019,C019,P018,10,120.0,02/22/2024,Completed
20,T020,C020,P010,1,45999.0,2024-02-25,Completed
21,T021,C021,P017,2,2999.0,2024-02-28,Completed
22,T022,C002,P001,1,45999.0,2024-03-01,Completed
23,T023,C003,P019,3,1499.0,03-02-2024,Completed
24,T024,C004,P009,5,650.0,2024-03-05,Completed
25,T025,C005,NaN,1,1999.0,2024-03-08,Completed
26,T026,C006,P011,1,4599.0,2024-03-10,Completed
27,T027,C007,P002,2,3499.0,03/12/2024,Completed
28,T028,C008,P015,4,450.0,2024-03-15,Completed
29,T029,C009,P007,1,52999.0,2024-03-18,Completed
30,T030,NaN,P004,3,2999.0,2024-03-20,Pending
31,T031,C011,P012,1,12999.0,03-22-2024,Completed
32,T032,C012,P016,1,32999.0,2024-03-25,Completed
33,T033,C013,P005,2,1999.0,2024-03-28,Completed
34,T034,C014,P008,2,1299.0,2024-03-30,Completed
35,T035,C015,P018,8,120.0,04/01/2024,Completed
36,T036,C016,P014,1,69999.0,2024-04-03,Completed
37,T037,C017,P006,4,899.0,2024-04-05,Completed
38,T038,C018,P020,1,1899.0,04-08-2024,Completed
39,T039,C019,P019,2,1499.0,2024-04-10,Completed
40,T040,C020,P013,1,5499.0,2024-04-12,Completed

In [173]:
#find and treat missing values in sales dataset
find_treat_missing_val(sales)

(   transaction_id customer_id product_id  quantity  unit_price  \
 0            T001        C001       P001         1     45999.0
 1            T002        C002       P004         2      2999.0
 2            T003        C003       P007         1     52999.0
 3            T004         NaN       P002         1      3499.0
 4            T005        C005       P009         3       650.0
 5            T006        C006       P012         1     12999.0
 6            T007        C007       P005         2      1999.0
 7            T008        C008        NaN         1      1299.0
 8            T009        C009       P011         1      4599.0
 9            T010        C010       P006         5       899.0
 10           T001        C001       P001         1     45999.0
 11           T011        C011       P014         1     69999.0
 12           T012        C012       P003         1     52999.0
 13           T013        C013       P015         3       450.0
 14           T014        C014       P019         2      1499.0
 15           T015        C015       P008         3      1299.0
 16           T016         NaN       P013         1      5499.0
 17           T017        C017       P016         1     32999.0
 18           T018        C018       P020         2      1899.0
 19           T019        C019       P018        10       120.0
 20           T020        C020       P010         1     45999.0
 21           T021        C021       P017         2      2999.0
 22           T022        C002       P001         1     45999.0
 23           T023        C003       P019         3      1499.0
 24           T024        C004       P009         5       650.0
 25           T025        C005        NaN         1      1999.0
 26           T026        C006       P011         1      4599.0
 27           T027        C007       P002         2      3499.0
 28           T028        C008       P015         4       450.0
 29           T029        C009       P007         1     52999.0
 30           T030         NaN       P004         3      2999.0
 31           T031        C011       P012         1     12999.0
 32           T032        C012       P016         1     32999.0
 33           T033        C013       P005         2      1999.0
 34           T034        C014       P008         2      1299.0
 35           T035        C015       P018         8       120.0
 36           T036        C016       P014         1     69999.0
 37           T037        C017       P006         4       899.0
 38           T038        C018       P020         1      1899.0
 39           T039        C019       P019         2      1499.0
 40           T040        C020       P013         1      5499.0

    transaction_date     status
 0        2024-01-15  Completed
 1        2024-01-16  Completed
 2        15/01/2024  Completed
 3        2024-01-18    Pending
 4        2024-01-20  Completed
 5        01-22-2024  Completed
 6        2024-01-23  Completed
 7        2024-01-25  Completed
 8        2024-01-28  Cancelled
 9        2024-02-01  Completed
 10       2024-01-15  Completed
 11       02/02/2024  Completed
 12       2024-02-05  Completed
 13       2024-02-08  Completed
 14       02-10-2024  Completed
 15       2024-02-12  Completed
 16       2024-02-15    Pending
 17       2024-02-18  Completed
 18       2024-02-20  Completed
 19       02/22/2024  Completed
 20       2024-02-25  Completed
 21       2024-02-28  Completed
 22       2024-03-01  Completed
 23       03-02-2024  Completed
 24       2024-03-05  Completed
 25       2024-03-08  Completed
 26       2024-03-10  Completed
 27       03/12/2024  Completed
 28       2024-03-15  Completed
 29       2024-03-18  Completed
 30       2024-03-20    Pending
 31       03-22-2024  Completed
 32       2024-03-25  Completed
 33       2024-03-28  Completed
 34       2024-03-30  Completed
 35       04/01/2024  Completed
 36       2024-04-03  Completed
 37       2024-04-05  Completed
 38       04-08-2024  Completed
 39       2024-04-10  Completed
 40       2024-04-12  Completed  ,
 ['customer_id is missing in 3 rows', 'product_id is missing in 2 rows'])

In [174]:
sales.shape

(41, 7)

In [175]:
#remove duplicates
sales = sales.drop_duplicates(keep='first',subset=['transaction_id',])
sales.shape

(40, 7)

In [176]:
#remove rows with missing critical foreign keys
sales = sales.dropna(subset=["transaction_id", "customer_id", "product_id"])
sales.shape

(35, 7)

In [177]:
#format transaction_date to YYYY-MM-DD
sales.loc[:, 'transaction_date'] = pd.to_datetime(
sales['transaction_date'], errors='coerce'
).dt.strftime("%Y-%m-%d")

In [178]:
sales.transaction_date

0     2024-01-15
1     2024-01-16
2            NaN
4     2024-01-20
5            NaN
6     2024-01-23
8     2024-01-28
9     2024-02-01
11           NaN
12    2024-02-05
13    2024-02-08
14           NaN
15    2024-02-12
17    2024-02-18
18    2024-02-20
19           NaN
20    2024-02-25
21    2024-02-28
22    2024-03-01
23           NaN
24    2024-03-05
26    2024-03-10
27           NaN
28    2024-03-15
29    2024-03-18
31           NaN
32    2024-03-25
33    2024-03-28
34    2024-03-30
35           NaN
36    2024-04-03
37    2024-04-05
38           NaN
39    2024-04-10
40    2024-04-12
Name: transaction_date, dtype: object

In [179]:
sales.loc[:, 'unique_id'] = sales['transaction_id'].astype(str) + '_' + sales['product_id'].astype(str)

In [180]:
sales

,transaction_id,customer_id,product_id,quantity,unit_price,transaction_date,status,unique_id
0,T001,C001,P001,1,45999.0,2024-01-15,Completed,T001_P001
1,T002,C002,P004,2,2999.0,2024-01-16,Completed,T002_P004
2,T003,C003,P007,1,52999.0,NaN,Completed,T003_P007
4,T005,C005,P009,3,650.0,2024-01-20,Completed,T005_P009
5,T006,C006,P012,1,12999.0,NaN,Completed,T006_P012
6,T007,C007,P005,2,1999.0,2024-01-23,Completed,T007_P005
8,T009,C009,P011,1,4599.0,2024-01-28,Cancelled,T009_P011
9,T010,C010,P006,5,899.0,2024-02-01,Completed,T010_P006
11,T011,C011,P014,1,69999.0,NaN,Completed,T011_P014
12,T012,C012,P003,1,52999.0,2024-02-05,Completed,T012_P003
13,T013,C013,P015,3,450.0,2024-02-08,Completed,T013_P015
14,T014,C014,P019,2,1499.0,NaN,Completed,T014_P019
15,T015,C015,P008,3,1299.0,2024-02-12,Completed,T015_P008
17,T017,C017,P016,1,32999.0,2024-02-18,Completed,T017_P016
18,T018,C018,P020,2,1899.0,2024-02-20,Completed,T018_P020
19,T019,C019,P018,10,120.0,NaN,Completed,T019_P018
20,T020,C020,P010,1,45999.0,2024-02-25,Completed,T020_P010
21,T021,C021,P017,2,2999.0,2024-02-28,Completed,T021_P017
22,T022,C002,P001,1,45999.0,2024-03-01,Completed,T022_P001
23,T023,C003,P019,3,1499.0,NaN,Completed,T023_P019
24,T024,C004,P009,5,650.0,2024-03-05,Completed,T024_P009
26,T026,C006,P011,1,4599.0,2024-03-10,Completed,T026_P011
27,T027,C007,P002,2,3499.0,NaN,Completed,T027_P002
28,T028,C008,P015,4,450.0,2024-03-15,Completed,T028_P015
29,T029,C009,P007,1,52999.0,2024-03-18,Completed,T029_P007
31,T031,C011,P012,1,12999.0,NaN,Completed,T031_P012
32,T032,C012,P016,1,32999.0,2024-03-25,Completed,T032_P016
33,T033,C013,P005,2,1999.0,2024-03-28,Completed,T033_P005
34,T034,C014,P008,2,1299.0,2024-03-30,Completed,T034_P008
35,T035,C015,P018,8,120.0,NaN,Completed,T035_P018
36,T036,C016,P014,1,69999.0,2024-04-03,Completed,T036_P014
37,T037,C017,P006,4,899.0,2024-04-05,Completed,T037_P006
38,T038,C018,P020,1,1899.0,NaN,Completed,T038_P020
39,T039,C019,P019,2,1499.0,2024-04-10,Completed,T039_P019
40,T040,C020,P013,1,5499.0,2024-04-12,Completed,T040_P013

In [181]:
sales.shape

(35, 8)

In [182]:
#calculate subtotal for orders
sales["subtotal"] = sales["quantity"] * sales["unit_price"]
sales["subtotal"]

0     45999.0
1      5998.0
2     52999.0
4      1950.0
5     12999.0
6      3998.0
8      4599.0
9      4495.0
11    69999.0
12    52999.0
13     1350.0
14     2998.0
15     3897.0
17    32999.0
18     3798.0
19     1200.0
20    45999.0
21     5998.0
22    45999.0
23     4497.0
24     3250.0
26     4599.0
27     6998.0
28     1800.0
29    52999.0
31    12999.0
32    32999.0
33     3998.0
34     2598.0
35      960.0
36    69999.0
37     3596.0
38     1899.0
39     2998.0
40     5499.0
Name: subtotal, dtype: float64

In [183]:
#aggregate sales to create orders table
orders = (
    sales
    .groupby("transaction_id", as_index=False)
    .agg({
        "customer_id": "first",
        "transaction_date": "first",
        "status": "first",
        "subtotal": "sum"
    })
)

In [184]:
#rename columns to match target schema
orders = orders.rename(columns={
    "transaction_id": "order_id",
    "transaction_date": "order_date",
    "subtotal": "total_amount"
})
orders

   order_id customer_id  order_date     status  total_amount
0      T001        C001  2024-01-15  Completed       45999.0
1      T002        C002  2024-01-16  Completed        5998.0
2      T003        C003        None  Completed       52999.0
3      T005        C005  2024-01-20  Completed        1950.0
4      T006        C006        None  Completed       12999.0
5      T007        C007  2024-01-23  Completed        3998.0
6      T009        C009  2024-01-28  Cancelled        4599.0
7      T010        C010  2024-02-01  Completed        4495.0
8      T011        C011        None  Completed       69999.0
9      T012        C012  2024-02-05  Completed       52999.0
10     T013        C013  2024-02-08  Completed        1350.0
11     T014        C014        None  Completed        2998.0
12     T015        C015  2024-02-12  Completed        3897.0
13     T017        C017  2024-02-18  Completed       32999.0
14     T018        C018  2024-02-20  Completed        3798.0
15     T019        C019        None  Completed        1200.0
16     T020        C020  2024-02-25  Completed       45999.0
17     T021        C021  2024-02-28  Completed        5998.0
18     T022        C002  2024-03-01  Completed       45999.0
19     T023        C003        None  Completed        4497.0
20     T024        C004  2024-03-05  Completed        3250.0
21     T026        C006  2024-03-10  Completed        4599.0
22     T027        C007        None  Completed        6998.0
23     T028        C008  2024-03-15  Completed        1800.0
24     T029        C009  2024-03-18  Completed       52999.0
25     T031        C011        None  Completed       12999.0
26     T032        C012  2024-03-25  Completed       32999.0
27     T033        C013  2024-03-28  Completed        3998.0
28     T034        C014  2024-03-30  Completed        2598.0
29     T035        C015        None  Completed         960.0
30     T036        C016  2024-04-03  Completed       69999.0
31     T037        C017  2024-04-05  Completed        3596.0
32     T038        C018        None  Completed        1899.0
33     T039        C019  2024-04-10  Completed        2998.0
34     T040        C020  2024-04-12  Completed        5499.0

In [185]:
#handle missing order_date by filling with default date
orders["order_date"] = orders["order_date"].fillna("1980-01-01")
orders

   order_id customer_id  order_date     status  total_amount
0      T001        C001  2024-01-15  Completed       45999.0
1      T002        C002  2024-01-16  Completed        5998.0
2      T003        C003  1980-01-01  Completed       52999.0
3      T005        C005  2024-01-20  Completed        1950.0
4      T006        C006  1980-01-01  Completed       12999.0
5      T007        C007  2024-01-23  Completed        3998.0
6      T009        C009  2024-01-28  Cancelled        4599.0
7      T010        C010  2024-02-01  Completed        4495.0
8      T011        C011  1980-01-01  Completed       69999.0
9      T012        C012  2024-02-05  Completed       52999.0
10     T013        C013  2024-02-08  Completed        1350.0
11     T014        C014  1980-01-01  Completed        2998.0
12     T015        C015  2024-02-12  Completed        3897.0
13     T017        C017  2024-02-18  Completed       32999.0
14     T018        C018  2024-02-20  Completed        3798.0
15     T019        C019  1980-01-01  Completed        1200.0
16     T020        C020  2024-02-25  Completed       45999.0
17     T021        C021  2024-02-28  Completed        5998.0
18     T022        C002  2024-03-01  Completed       45999.0
19     T023        C003  1980-01-01  Completed        4497.0
20     T024        C004  2024-03-05  Completed        3250.0
21     T026        C006  2024-03-10  Completed        4599.0
22     T027        C007  1980-01-01  Completed        6998.0
23     T028        C008  2024-03-15  Completed        1800.0
24     T029        C009  2024-03-18  Completed       52999.0
25     T031        C011  1980-01-01  Completed       12999.0
26     T032        C012  2024-03-25  Completed       32999.0
27     T033        C013  2024-03-28  Completed        3998.0
28     T034        C014  2024-03-30  Completed        2598.0
29     T035        C015  1980-01-01  Completed         960.0
30     T036        C016  2024-04-03  Completed       69999.0
31     T037        C017  2024-04-05  Completed        3596.0
32     T038        C018  1980-01-01  Completed        1899.0
33     T039        C019  2024-04-10  Completed        2998.0
34     T040        C020  2024-04-12  Completed        5499.0

In [186]:
#create order_items table from sales
order_items = sales[[
    "transaction_id",
    "product_id",
    "quantity",
    "unit_price",
    "subtotal"
]].copy()

In [187]:
#rename columns to match target schema
order_items = order_items.rename(columns={
    "transaction_id": "order_id"
})
order_items

   order_id product_id  quantity  unit_price  subtotal
0      T001       P001         1     45999.0   45999.0
1      T002       P004         2      2999.0    5998.0
2      T003       P007         1     52999.0   52999.0
4      T005       P009         3       650.0    1950.0
5      T006       P012         1     12999.0   12999.0
6      T007       P005         2      1999.0    3998.0
8      T009       P011         1      4599.0    4599.0
9      T010       P006         5       899.0    4495.0
11     T011       P014         1     69999.0   69999.0
12     T012       P003         1     52999.0   52999.0
13     T013       P015         3       450.0    1350.0
14     T014       P019         2      1499.0    2998.0
15     T015       P008         3      1299.0    3897.0
17     T017       P016         1     32999.0   32999.0
18     T018       P020         2      1899.0    3798.0
19     T019       P018        10       120.0    1200.0
20     T020       P010         1     45999.0   45999.0
21     T021       P017         2      2999.0    5998.0
22     T022       P001         1     45999.0   45999.0
23     T023       P019         3      1499.0    4497.0
24     T024       P009         5       650.0    3250.0
26     T026       P011         1      4599.0    4599.0
27     T027       P002         2      3499.0    6998.0
28     T028       P015         4       450.0    1800.0
29     T029       P007         1     52999.0   52999.0
31     T031       P012         1     12999.0   12999.0
32     T032       P016         1     32999.0   32999.0
33     T033       P005         2      1999.0    3998.0
34     T034       P008         2      1299.0    2598.0
35     T035       P018         8       120.0     960.0
36     T036       P014         1     69999.0   69999.0
37     T037       P006         4       899.0    3596.0
38     T038       P020         1      1899.0    1899.0
39     T039       P019         2      1499.0    2998.0
40     T040       P013         1      5499.0    5499.0

Insert cleaned data into MySQL database using Python

In [188]:
import mysql.connector


def upload_to_mysql(df: pd.DataFrame, table_name: str, exclude_cols=None):
    if exclude_cols is None:
        exclude_cols = []

    # Convert NaN â†’ None (required for MySQL)
    df = df.where(pd.notna(df), None)

    # Columns to insert
    insert_cols = [col for col in df.columns if col not in exclude_cols]

    columns_sql = ", ".join(insert_cols)
    placeholders = ", ".join(["%s"] * len(insert_cols))

    sql = f"""
        INSERT INTO {table_name} ({columns_sql})
        VALUES ({placeholders})
    """
# Connect to MySQL
    conn = mysql.connector.connect(
        host="localhost",
        user="root",
        password="Saak@2000",
        database="fleximart"
    )

    cursor = conn.cursor()
# Insert rows
    try:
        for _, row in df.iterrows():
            values = tuple(row[col] for col in insert_cols)
            cursor.execute(sql, values)

        conn.commit()
        print(f"Inserted {len(df)} rows into {table_name}")
# Handle exceptions
    except Exception as e:
        conn.rollback()
        print(f"Error inserting into {table_name}:", e)

    finally:
        cursor.close()
        conn.close()

In [189]:
# Upload cleaned customers data
upload_to_mysql(
    df=customers,
    table_name="customers",
)

Inserted 25 rows into customers

In [190]:
# Upload products data
upload_to_mysql(
    df=products,
    table_name="products",
)

Inserted 20 rows into products

In [191]:
# Upload orders data
upload_to_mysql(
    df=orders,
    table_name="orders"
)

Inserted 35 rows into orders

In [192]:
# Upload order_items data
upload_to_mysql(
    df=order_items,
    table_name="order_items",
    exclude_cols=["order_item_id"]
)

Inserted 35 rows into order_items